{
  "content": [
    {
      "title": "Understanding the Linux Kernel, 3rd Edition",
      "url": "https://learning.oreilly.com/library/cover/0596005652/250w",
      "price": 11,
      "abb": "linux",
      "date": "November 2005",
      "authors": ["Daniel P. Bovet", "Marco Cesati"],
      "isbn": "9780596005658",
      "intro":  "Takes you on a guided tour of the most significant data structures, algorithms, and programming tricks used in the kernel.",
      "description":  "In order to thoroughly understand what makes Linux tick and why it works so well on a wide variety of systems, you need to delve deep into the heart of the kernel. The kernel handles all interactions between the CPU and the external world, and determines which programs will share processor time, in what order. It manages limited memory so well that hundreds of processes can share the system efficiently, and expertly organizes data transfers so that the CPU isn't kept waiting any longer than necessary for the relatively slow disks.The third edition of Understanding the Linux Kernel takes you on a guided tour of the most significant data structures, algorithms, and programming tricks used in the kernel. Probing beyond superficial features, the authors offer valuable insights to people who want to know how things really work inside their machine. Important Intel-specific features are discussed. Relevant segments of code are dissected line by line. But the book covers more than just the functioning of the code; it explains the theoretical underpinnings of why Linux does things the way it does.This edition of the book covers Version 2.6, which has seen significant changes to nearly every kernel subsystem, particularly in the areas of memory management and block devices. The book focuses on the following topics:Memory management, including file buffering, process swapping, and Direct memory Access (DMA)The Virtual Filesystem layer and the Second and Third Extended FilesystemsProcess creation and schedulingSignals, interrupts, and the essential interfaces to device driversTimingSynchronization within the kernelInterprocess Communication (IPC)Program executionUnderstanding the Linux Kernel will acquaint you with all the inner workings of Linux, but it's more than just an academic exercise. You'll learn what conditions bring out Linux's best performance, and you'll see how it meets the challenge of providing good system response during process scheduling, file access, and memory management in a wide variety of environments. This book will help you make the most of your Linux system."
    },
    {
      "title": "Version Control with Git, 3rd Edition",
      "date": "October 2022",
      "url": "https://learning.oreilly.com/library/cover/9781492091189/250w",
      "price": 0,
      "abb": "gve",
      "description": "",
      "authors": ["Prem Kumar Ponuthorai", "Jon Loeliger"]
    },
    {
      "title": "The C Programming Language, 2nd Edition",
      "date": "1978",
      "url": "https://m.media-amazon.com/images/I/411ejyE8obL._SX377_BO1,204,203,200_.jpg",
      "price": 0,
      "abb": "KRC",
      "description": "The authors present the complete guide to ANSI standard C language programming. Written by the developers of C, this new version helps readers keep up with the finalized ANSI standard for C while showing how to take advantage of C's rich set of operators, economy of expression, improved control flow, and data structures. The 2/E has been completely rewritten with additional examples and problem sets to clarify the implementation of difficult language constructs. For years, C programmers have let K&R guide them to building well-structured and efficient programs. Now this same help is available to those working with ANSI compilers. Includes detailed coverage of the C language plus the official C language reference manual for at-a-glance help with syntax notation, declarations, ANSI changes, scope rules, and the list goes on and on.",
      "authors": ["Brian Kernighan", "Dennis Ritchie"]
    },
    {
      "title": "Core Java (Volume I), 12th Edition",
      "date": "September 2007",
      "url": "https://horstmann.com/corejava/cj12v1.png",
      "price": 20,
      "abb": "core_java",
      "description": "",
      "authors": ["Cay S. Horstmann", "Gary Cornell"]
    },
    {
      "title": "Computer Systems: A Programmer's Perspective",
      "date": "2002",
      "url": "https://csapp.cs.cmu.edu/3e/images/csapp3e-cover.jpg",
      "price": 20,
      "abb": "csapp",
      "description": "This book explains the important and enduring concepts underlying all computer systems, and shows the concrete ways that these ideas affect the correctness, performance, and utility of application programs. The book's concrete and hands-on approach will help readers understand what is going on ?under the hood? of a computer system. This book focuses on the key concepts of basic network programming, program structure and execution, running programs on a system, and interaction and communication between programs. For anyone interested in computer organization and architecture as well as computer systems.",
      "authors": ["Randal Bryant"]
    },
    {
      "title": "Fluent Python",
      "date": "July 24, 2015",
      "url": "https://m.media-amazon.com/images/I/41R+fNX-akL._SX379_BO1,204,203,200_.jpg",
      "price": 50,
      "abb": "python",
      "description": "",
      "authors": ["Luciano Ramalho"]
    },
    {
      "title": "Linear Algebra and Its Applications",
      "date": "August, 2005",
      "url": "https://img2.doubanio.com/view/subject/s/public/s27291003.jpg",
      "price": 40,
      "abb": "core_java",
      "description": "",
      "authors": ["David C Lay"]
    },
    {
      "title": "The Kite Runner",
      "date": "2003",
      "url": "https://upload.wikimedia.org/wikipedia/en/6/62/Kite_runner.jpg",
      "price": 25,
      "abb": "kite",
      "description": "",
      "authors": ["Khaled Hosseini"]
    }
  ]
}